<a href="https://colab.research.google.com/github/rudipop/Rudi_Aulas_Python/blob/main/Python_Aula2_Parte6_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

PANDAS

In [67]:
import numpy as np
import pandas as pd
MesesdoAno = np.array(['janeiro','fevereiro','março','abril','maio','junho','julho','agosto','setembro','outubro','novembro','dezembro'])
Alunos_6ano = np.array(['Gabriel','Felipe'])

In [24]:
MesesdoAno

array(['janeiro', 'fevereiro', 'março', 'abril', 'maio', 'junho', 'julho',
       'agosto', 'setembro', 'outubro', 'novembro', 'dezembro'],
      dtype='<U9')

In [28]:
vet = np.random.randint(1,20,24)
vet

array([ 2, 10,  5,  6,  4,  7, 15, 12,  2, 17, 15, 10,  9,  2,  1,  7, 14,
        4, 10, 16, 10,  7, 14, 10])

In [29]:
# cria series a partir do numpy array
df = pd.Series(vet)
df

0      2
1     10
2      5
3      6
4      4
5      7
6     15
7     12
8      2
9     17
10    15
11    10
12     9
13     2
14     1
15     7
16    14
17     4
18    10
19    16
20    10
21     7
22    14
23    10
dtype: int64

In [11]:
df.head(10) # o default é 5

0    13
1     2
2     7
3    11
4    13
5    17
6    16
7     1
8     6
9    16
dtype: int64

In [13]:
df.tail()

21     8
22    16
23     4
24    12
25     5
dtype: int64

In [30]:
# criar dataframe
vet2 = vet.reshape((2,12))
vet2

array([[ 2, 10,  5,  6,  4,  7, 15, 12,  2, 17, 15, 10],
       [ 9,  2,  1,  7, 14,  4, 10, 16, 10,  7, 14, 10]])

In [31]:
df2 = pd.DataFrame(vet2)
df2

   0   1   2   3   4   5   6   7   8   9   10  11
0   2  10   5   6   4   7  15  12   2  17  15  10
1   9   2   1   7  14   4  10  16  10   7  14  10

In [25]:
df2.head()

   0   1   2   3   4   5   6   7   8   9   10  11  12
0  13   2   7  11  13  17  16   1   6  16  15   8  18
1   9   9   3  19  14   1  18   3   8  16   4  12   5

In [40]:
df2.columns = MesesdoAno
df2.index = Alunos_6ano
df2

         janeiro  fevereiro  março  ...  outubro  novembro  dezembro
Gabriel        2         10      5  ...       17        15        10
Felipe         9          2      1  ...        7        14        10

[2 rows x 12 columns]

In [43]:
df2.iloc[0,0] # acessar elemento pelo indice

2

In [46]:
df2.loc['Gabriel','setembro']

2

In [49]:
df2.loc[['Gabriel','Felipe'],'outubro']

Gabriel    17
Felipe      7
Name: outubro, dtype: int64

In [51]:
df2.loc['Gabriel']

janeiro       2
fevereiro    10
março         5
abril         6
maio          4
junho         7
julho        15
agosto       12
setembro      2
outubro      17
novembro     15
dezembro     10
Name: Gabriel, dtype: int64

In [54]:
df2.loc[:,'dezembro'] # o dois ponto para indicar todas as linhas, acessa elemento pelo nome

Gabriel    10
Felipe     10
Name: dezembro, dtype: int64

In [56]:
df2.describe() # estatistica dos dados

        janeiro  fevereiro     março  ...    outubro   novembro  dezembro
count  2.000000   2.000000  2.000000  ...   2.000000   2.000000       2.0
mean   5.500000   6.000000  3.000000  ...  12.000000  14.500000      10.0
std    4.949747   5.656854  2.828427  ...   7.071068   0.707107       0.0
min    2.000000   2.000000  1.000000  ...   7.000000  14.000000      10.0
25%    3.750000   4.000000  2.000000  ...   9.500000  14.250000      10.0
50%    5.500000   6.000000  3.000000  ...  12.000000  14.500000      10.0
75%    7.250000   8.000000  4.000000  ...  14.500000  14.750000      10.0
max    9.000000  10.000000  5.000000  ...  17.000000  15.000000      10.0

[8 rows x 12 columns]

Exercicio

In [73]:
dados = pd.read_csv('DadosDemograficos.csv')

In [60]:
dados.head()

           Country Name Country Code  ...  Internet users         Income Group
0                 Aruba          ABW  ...            78.9          High income
1           Afghanistan          AFG  ...             5.9           Low income
2                Angola          AGO  ...            19.1  Upper middle income
3               Albania          ALB  ...            57.2  Upper middle income
4  United Arab Emirates          ARE  ...            88.0          High income

[5 rows x 5 columns]

In [63]:
dados.shape

(195, 5)

In [65]:
dados.head(6)

           Country Name Country Code  ...  Internet users         Income Group
0                 Aruba          ABW  ...            78.9          High income
1           Afghanistan          AFG  ...             5.9           Low income
2                Angola          AGO  ...            19.1  Upper middle income
3               Albania          ALB  ...            57.2  Upper middle income
4  United Arab Emirates          ARE  ...            88.0          High income
5             Argentina          ARG  ...            59.9          High income

[6 rows x 5 columns]

In [72]:
dados.describe()

       Birth rate  Internet users
count  195.000000      195.000000
mean    21.469928       42.076471
std     10.605467       29.030788
min      7.900000        0.900000
25%     12.120500       14.520000
50%     19.680000       41.000000
75%     29.759500       66.225000
max     49.661000       96.546800

In [90]:
dados.dtypes

Country Name       object
Country Code       object
Birth rate        float64
Internet users    float64
Income Group       object
dtype: object

In [92]:
dados.columns

Index(['Country Name', 'Country Code', 'Birth rate', 'Internet users',
       'Income Group'],
      dtype='object')

In [109]:
dados['Country Name'] == 'Malta'
Malta

0      False
1      False
2      False
3      False
4      False
       ...
190    False
191    False
192    False
193    False
194    False
Name: Country Name, Length: 195, dtype: bool

In [111]:
dados.sort_values(by='Country Name')

              Country Name Country Code  ...  Internet users         Income Group
1              Afghanistan          AFG  ...             5.9           Low income
3                  Albania          ALB  ...            57.2  Upper middle income
49                 Algeria          DZA  ...            16.5  Upper middle income
2                   Angola          AGO  ...            19.1  Upper middle income
7      Antigua and Barbuda          ATG  ...            63.4          High income
..                     ...          ...  ...             ...                  ...
185  Virgin Islands (U.S.)          VIR  ...            45.3          High income
188     West Bank and Gaza          PSE  ...            46.6  Lower middle income
190            Yemen, Rep.          YEM  ...            20.0  Lower middle income
193                 Zambia          ZMB  ...            15.4  Lower middle income
194               Zimbabwe          ZWE  ...            18.5           Low income

[195 rows x 5 columns]

In [120]:
dados[(dados["Birth rate"] > 35.0) & (dados["Internet users"] < 25) & (dados["Income Group"] == 'High income') ]

         Country Name Country Code  Birth rate  Internet users Income Group
67  Equatorial Guinea          GNQ      35.362            16.4  High income

In [123]:
filter = (dados['Birth rate'] > 35) & (dados['Internet users'] < 25) & (dados['Income Group'] == 'High income')
dados[filter]

         Country Name Country Code  Birth rate  Internet users Income Group
67  Equatorial Guinea          GNQ      35.362            16.4  High income

In [115]:
dados[(dados["Birth rate"] > 45.0) & (dados["Internet users"] < 25) & (dados["Income Group"] == 'Upper middle income') ]

  Country Name Country Code  Birth rate  Internet users         Income Group
2       Angola          AGO      45.985            19.1  Upper middle income

In [124]:
filtro3 = dados['Country Name'] == 'Malta'
dados[Malta]

    Country Name Country Code  Birth rate  Internet users Income Group
116        Malta          MLT         9.5         68.9138  High income

In [117]:
dados[(dados['Country Name'] == 'Malta')]

    Country Name Country Code  Birth rate  Internet users Income Group
116        Malta          MLT         9.5         68.9138  High income

In [119]:
Malta = dados['Country Name'] == 'Malta'
dados[Malta]

    Country Name Country Code  Birth rate  Internet users Income Group
116        Malta          MLT         9.5         68.9138  High income